{
  "1": {
    "name": "Iron Bosch TDA702821I",
    "id": 1,
    "price": 250.0,
    "imageSrc": [
      "BestBuy/resources/img/products/0_Iron Bosch TDA702821I.jpg",
      "BestBuy/resources/img/products/1_Iron Bosch TDA702821I.jpg",
      "BestBuy/resources/img/products/2_Iron Bosch TDA702821I.jpg"
    ],
    "isPopular": true,
    "description" : "Утюг Bosch TDA702821 I с мощным паровым ударом и инновационной подошвой. Элегантный стиль, великолепная функциональность и высокие технические характеристики делает Bosch TDA702821 I выгодным приобретением. Модель изготовлена в белом цвете, имеет розовые вставки. Утюг получил пластиковый корпус, не скользящую накладку в области ручки, вращающийся шнур и привычное расположение кнопок управления. Утюг имеет эргономичный дизайн, что способствует максимальному комфорту во время глажки. Для удобного залива воды предусмотрено широкое отверстие. Кроме того имеется система \"Капля-стоп\" и функция \"Спрей\"."
  },
  "2": {
    "name": "Cup Jetboil FluxRing Sol Titanium Companion Cup 800 мл JB CCP080-TI-08L",
    "id": 2,
    "price": 100.0,
    "imageSrc": [
      "BestBuy/resources/img/products/0_Cup Jetboil FluxRing Sol Titanium Companion Cup 800 мл JB CCP080-TI-08L.jpg",
      "BestBuy/resources/img/products/1_Cup Jetboil FluxRing Sol Titanium Companion Cup 800 мл JB CCP080-TI-08L.jpg",
      "BestBuy/resources/img/products/2_Cup Jetboil FluxRing Sol Titanium Companion Cup 800 мл JB CCP080-TI-08L.jpg"
    ],
    "isPopular": false,
    "description" : "FluxRing Sol Titanium Companion Cup — легкая титановая чашка с крышкой для приготовления пищи в походных условиях. Предназначена исключительно для быстрого кипячения воды. Подходит для систем приготовления пищи Jetboil Sol, Jetboil Zip, Jetboil Flash и PCS. Для обеспечения безопасности, чашка имеет надежную изоляцию. Удобная, безопасная ручка позволит снимать горячую чашку с огня."
  },
  "3": {
    "name": "Phone Apple iPhone 7 Plus",
    "id": 3,
    "price": 1000.0,
    "imageUrl": [],
    "imageSrc": [
      "BestBuy/resources/img/products/0_Phone Apple iPhone 7 Plus.jpg",
      "BestBuy/resources/img/products/1_Phone Apple iPhone 7 Plus.jpg",
      "BestBuy/resources/img/products/2_Phone Apple iPhone 7 Plus.png"
    ],
    "isPopular": true,
    "description" : "Десятое поколение купертиновских смартфонов представляет Apple iPhone 7 Plus 128 GB Jet Black — телефон с поистине флагманской начинкой. Новинка получила самую лучшую камеру и самый мощный процессор на рынке. Купертиновцы явно старались не зря и сделали всё, чтобы вы были довольны своим гаджетом.\nВыглядит престижно Модель представлена в расцветке «чёрный оникс» — жгуче чёрный цвет с глянцевым эффектом, образуемым девятиэтапным процессом полировки. Оттенок получился настолько глубоким, что практически сливается со стеклом экрана, грань между которым едва заметна. Материалом для корпуса выбран неизменный анодированный алюминий серии 7000, который также используется в космической индустрии. Корпус не только прочный, но и герметичный, поскольку собран по стандарту IP67. Внутрь не попадают даже мелкие частицы пыли. Также устройство надёжно защищено от брызг, и нестрашно, если на него попадёт часть пролитой воды из стакана.\nЭкран для любых задач\nПланшетофон — оптимальный выбор гаджетоманов и людей, часто пребывающих в движении. На большом смартфоне можно делать всё, что угодно. Читать, переписываться, сёрфить Интернет, смотреть видео — 5,5-дюймовый экран с FullHD-разрешением этому отлично способствует. Позаимствованная у предшественника технология 3D-Touch упростит управление ввиду многообразия жестов. Можно использовать не только касание, смахивание по экрану или разведение/сдвиг пальцев, но и силу нажатия. Кроме того, дисплей «семёрки» может похвастать улучшенной цветопередачей и повышенной на 25% яркостью. Играть в видеоигры и смотреть фильмы ещё не было настолько приятно.\nГрафика Apple iPhone 7 Plus быстрее в 240 раз\nДесятое поколение получило процессор A10 Fusion, который стал быстрее на 40%, чем А9, и в 2 раза, чем А8. По сравнению с первым айфоном, производительность так и вовсе возросла в 120 раз. Что касается графики, то новичок превосходит А9 на 50%, а А8 в 3 раза. Первого представителя модель обгоняет в целых 240 раз. Что тут говорить? Эпл Айфон 7 Плюс 128 Гб Чёрный Оникс — бесспорно, самый мощный телефон, и цена на него выставлена вполне заслуженно. К тому же у него на борту целых 3 Гб оперативной памяти, которые позволяют оптимизированной операционной системе iOS 10 работать лучше и продуктивнее.\nПрофессиональное фото\nДавно мечтали о профессиональной камере на мобильном устройстве? Этот день настал! «Семёрка» получила двухмодульную iSight-камеру. Оба объектива оснащены 6 линзами и 12-мегапиксельными сенсорами. Один из модулей — широкоугольный и имеет апертуру f/1.8, а другой — с телеобъективом и диафрагмой f/2.8. Но самая прелесть — это оптическая стабилизация изображения, которая впервые задействована в смартфоне. Теперь можно снимать в движении не только видео, но и фотографии. Кадр будет чётким и неповторимым. Помимо этого, обычные снимки и Live Photos порадуют более насыщенным цветом и ярким светом. Тому причина — расширение цветового охвата и появление 4-светодиодной вспышки. Наличие двух объективов позволяет создавать боке-портреты (акцентирование объекта съёмки за счёт размытия фона). Это ещё одна фишка, которой прежде обладали только цифровые фотокамеры. Теперь съёмкой профессионального уровня может похвастать и айфон."
  },
  "4": {
    "name": "HDD Transcend StoreJet 25H3P 2TB TS2TSJ25H3B 2.5 USB 3.0",
    "id": 4,
    "price": 100.0,
    "imageUrl": [],
    "imageSrc": [
      "BestBuy/resources/img/products/0_HDD Transcend StoreJet 25H3P 2TB TS2TSJ25H3B 2.5 USB 3.0.jpg",
      "BestBuy/resources/img/products/1_HDD Transcend StoreJet 25H3P 2TB TS2TSJ25H3B 2.5 USB 3.0.jpg"
    ],
    "isPopular": false,
    "description" : "Компания Transcend, мировой лидер среди производителей мультимедиа и накопителей, представила новый портативный жёсткий диск высокой ёмкости StoreJet 25H3, поддерживающий SuperSpeed USB 3.0. Модель имеет огромную ёмкость и поставляются в комплекте с новым улучшенным программным пакетом для работы с данными Transcend Elite, который позволяет современным пользователям удобно организовать хранение и поддерживать в актуальном состоянии их цифровой контент.\nНовый накопитель StoreJet 25H3 имеет надёжный ударопрочный корпус, которые обеспечивают высочайший уровень защиты от случайных падений для того огромного объёма информации, который позволяет хранить их повышенная вместимость. Помимо резинового противоскользящего покрытия, модель имеет усиленный жёсткий каркас, который равномерно распределяет силу удара, а также внутреннюю демпфирующую подвеску для жёсткого диска в качестве последней линии обороны. Оба новых накопителя прошли жёсткое тестирование на устойчивость к падениям по стандартам американской армии, что делает их одними из наиболее прочных портативных жёстких дисков среди представленных на современном рынке.\nПортативный жёсткий диск StoreJet 25H3 — мощное устройство для хранения данных сочетает превосходную производительность интерфейса USB 3.0, колоссальный объём и трёхступенчатую противоударную систему. Благодаря скорости передачи данных, которая достигает 90 МБ/с, накопитель StoreJet 25H3 является идеальным выбором для любителей скорости. Перенос целого фильма в формате DVD занимает меньше минуты! Благодаря обратной совместимости StoreJet 25H3 позволяет пользователям получать доступ к своим файлам практически на любом компьютере.\nStoreJet 25H3 оснащен необычайно удобной кнопкой для запуска автоматического резервного копирования, которая позволяет пользователям моментально синхронизировать свою информацию на внешнем диске и на компьютере."
  },
  "5": {
    "name": "SSD Samsung 850 Pro series 128GB 2.5\" SATAIII MLC",
    "id": 5,
    "price": 200.0,
    "imageUrl": [],
    "imageSrc": [
      "BestBuy/resources/img/products/0_SSD Samsung 850 Pro series 128GB 2.5 SATAIII MLC.jpg",
      "BestBuy/resources/img/products/1_SSD Samsung 850 Pro series 128GB 2.5 SATAIII MLC.jpg"
    ],
    "isPopular": false,
    "description" : "SSD накопитель Samsung 850 Pro изготавливается с использованием инновационной архитектуры 3D V-NAND, благодаря которой накопитель представляет собой 32-слойный пирог, в то время как по существующей технологии повышение плотности ячеек обеспечивалась за счет уменьшения физических размеров ячеек, в результате чего достигалось уменьшение форм-фактора накопителя.\nПрименение новой технологии позволило существенное уменьшить размеры SSD накопителей и устранить необходимость повышения плотности ячеек за счет уменьшения их размеров, как это было при использовании традиционной планарной NAND архитектуры.\nСамые быстрые в отрасли 3D V-NAND SSD накопители Samsung\nБлагодаря инновационной технологии Samsung 3D V-NAND, SSD накопитель обеспечивают непревзойденную скорость в режиме последовательного и случайного считывания/записи данных.\nПереключитесь на высшую передачу в режиме RAPID\nВ режиме RAPID вы сможете повысить скорость считывания / записи своих данных. Также как и в автомобиле, в режиме RAPID* программа Magician позволит вам увеличить скорость обработки данных на системном уровне, используя DRAM модули оперативной памяти ПК в качестве кэша.\nНовейшая технология для повышения эффективности вашей работы\nСистема управления энергопотреблением, используемая в накопителе 850 Pro, позволит вам продлить ресурс накопителя и повысить эффективность вашей работы. SSD накопитель Samsung 850 Pro отличается наименьшим в отрасли энергопотреблением. Накопитель 850 Pro поддерживает режим сна в ультрабуках Ultrabook, потребляя в этом режиме лишь 2 мВт.\nДинамическая теплозащита\nДинамическая теплозащита в накопителях 850 Pro также обеспечивает сохранность ваших данных.\nБезопасность данных гарантирована\nAES-256-битное шифрование для обеспечения безопасности\nПростая процедура установки SSD накопителя 850 Pro\nПрограмма One-stop Install Navigator позволяет за три шага перенести ваши данные с SSD или HDD накопителей на накопитель 850 Pro. Программа Samsung Magician обеспечит оптимизацию производительности вашего накопителя.\nСлаженная работа всех компонентов\nВсе компоненты SSD накопителя разработаны и изготовлены в Samsung. Это обеспечивает максимальную производительность, и низкое энергопотребление модулей памяти LPDDR2 DRAM."
  },
  "6": {
    "name": "HDD Silicon Power Armor A15 2TB SP020TBPHDA15S3L 2.5 USB 3.0 Red",
    "id": 6,
    "price": 100.0,
    "imageUrl": [],
    "imageSrc": [
      "BestBuy/resources/img/products/0_HDD Silicon Power Armor A15 2TB SP020TBPHDA15S3L 2.5 USB 3.0 Red.jpg"
    ],
    "isPopular": true,
    "description" : "Silicon Power Armor A15 — особая защита от ударов и высокая производительность\nЗащита от ударов\nСоответствует военным стандартам США — MIL-STD-810F 516.5 procedure IV (тест на падение) и протестирован на:\nПадение продукта непосредственно на бетонный пол (или более твердая поверхность)\nТест с использованием оборудования для теста на падения: свободное падение с высоты 122 см\nПротестированы 26 контактных точек (8 углов, 12 боковых сторон, 6 поверхностью\nКнопка быстрого резервного копирования One touch и специальное ПО\nФункция one-touch backup и программное обеспечение обеспечивают пользователям новый опыт хранения данных, высокий уровень защиты данных и еще большее удобство.\nВысокая скорость передачи данных\nA15 оснащен высокоскоростным интерфейсом USB 3.0 с пропускной способностью 5 Гбит/с, что в 10 раз превышает пропускную способность интерфейса USB 2.0, что позволяет сократить время при передачи массивных файлов."
  },
  "7": {
    "name": "SSD Kingston SSDNow KC400 1TB 2.5 SATAIII MLC",
    "id": 7,
    "price": 200.0,
    "imageUrl": [],
    "imageSrc": [
      "BestBuy/resources/img/products/0_Kingston SSDNow KC400 1TB 2.5 SATAIII MLC.jpg",
      "BestBuy/resources/img/products/1_Kingston SSDNow KC400 1TB 2.5 SATAIII MLC.jpg",
      "BestBuy/resources/img/products/2_Kingston SSDNow KC400 1TB 2.5 SATAIII MLC.jpg"
    ],
    "isPopular": false,
    "description" : "Твердотельные накопители KC400 компании Kingston работают в 15 раз быстрее по сравнению с жесткими дисками, они обеспечивают стабильную скорость для сжимаемых и несжимаемых данных и повышают отзывчивость систем при запуске ресурсоемких приложений. В них используется 8-канальный контроллер Phison PS3110-S10 и четырехъядерный процессор для ускорения обработки повседневных задач и повышения продуктивности.\nНакопители обеспечивают сквозную защиту данных и поддерживают технологию SmartECC для сохранности данных, а также SmartRefresh для защиты от ошибок чтения. В случае возникновения ошибок данные воссоздаются; накопители восстанавливаются после аварийного отключения питания, благодаря защите от отключения питания на основе встроенного ПО. Современные контроллеры и память NAND обеспечивают высокую надежность хранения данных.\nПреимущества:\n•	В 15 раз быстрее жесткого диска — повысьте производительность пользователей и экономьте время при выполнении повседневных задач с помощью высокой скорости работы накопителей KC400\n•	Ограниченная пятилетняя гарантия — для дополнительной уверенности накопители KC400 имеют ограниченную пятилетнюю гарантию и бесплатную техническую поддержку\n•	Простая установка — накопители KC400 могут поставляться в виде комплекта для обновления, в который входит все необходимое для простой установки"
  },
  "9": {
    "name": "USB-hub Maiwo USB 3.0 4 ports Silver",
    "id": 9,
    "price": 20.0,
    "imageUrl": [],
    "imageSrc": [
      "BestBuy/resources/img/products/0_USB-hub Maiwo USB 3.0 4 ports Silver.jpg",
      "BestBuy/resources/img/products/1_USB-hub Maiwo USB 3.0 4 ports Silver.jpg"
    ],
    "isPopular": false,
    "description" : "Концентратор SuperSpeed USB 3.0 Hub компании Transcend идеально подходит для использования с современными ультрабуками и тонкими и лёгкими ноутбуками. HUB3 мгновенно превращает один USB 3.0 порт в четыре, предоставляя возможность подключать больше устройств одновременно к портам с высоким быстродействием. Благодаря комплектному адаптеру питания, HUB3 предоставляет на порт 2 А для быстрой зарядки. Это позволяет быстро восполнять заряд батареи Apple iPad и других портативных устройств, которые требуют большого количества энергии для более быстрой зарядки по USB."
  },
  "10": {
    "name": "Lenovo ThinkPad E560",
    "id": 10,
    "price": 1000.0,
    "imageUrl": [],
    "imageSrc": [
      "BestBuy/resources/img/products/0_Lenovo ThinkPad E560.png",
      "BestBuy/resources/img/products/1_Lenovo ThinkPad E560.jpg",
      "BestBuy/resources/img/products/2_Lenovo ThinkPad E560.jpg",
      "BestBuy/resources/img/products/3_Lenovo ThinkPad E560.jpg",
      "BestBuy/resources/img/products/4_Lenovo ThinkPad E560.jpg",
      "BestBuy/resources/img/products/5_Lenovo ThinkPad E560.jpg"
    ],
    "isPopular": false,
    "description" : "Производительный и надежный ноутбук ThinkPad E560 — это сочетание безопасности, стильного профессионального дизайна и широких мультимедийных возможностей. Кроме того, технология Lenovo OneLink позволяет подключать устройство к док-станции и заряжать аккумулятор — и все это при помощи одного кабеля.\nТехнология Lenovo OneLink\nПолучите дополнительные возможности, используя провод питания! Технология OneLink — это уникальный интерфейс, упрощающий подключение с помощью обычного кабеля к док-станции ThinkPad OneLink Dock. На док-станции OneLink имеются специальные видео- и аудиоразъемы, порты USB 3.0, Gigabit Ethernet, работающие во время зарядки ноутбука.\nПродолжительное время автономной работы\nНоутбук ThinkPad E560 способен работать автономно до 9 часов, позволяя вам оставаться на связи, даже если аккумулятор ноутбука невозможно зарядить.\nУникальная клавиатура\nЛегендарная полноразмерная клавиатура ThinkPad с защитой от пролитой жидкости и манипулятором TrackPoint широко известна благодаря своей эргономичности, функциональности и удобству. В комплектацию также включена более крупная пятиточечная сенсорная панель TrackPad. Точки касаний могут быть сконфигурированы несколькими способами с помощью настроек.\nДинамики с поддержкой технологии Dolby Advanced Audio\nОцените высочайшее качество пространственного звука при прослушивании презентации и просмотре фильма. Эта технология позволяет улучшить чистоту звука для приложений VoIP, максимально увеличить громкость без потери качества и наслаждаться кристально четким звуком при просмотре фильмов.\nВстроенная веб-камера высокого разрешения 720p и двунаправленные микрофоны с функцией шумоподавления\nУчаствуя в веб-конференциях, вы ничего не пропустите. В вашем распоряжении приспособленная для работы в условиях низкой освещенности веб-камера высокого разрешения (720p) с широкими углами обзора и функцией отслеживания лиц, двунаправленные микрофоны с функцией шумоподавления и настройками, обеспечивающими кристальную ясность звука при частных звонках и конференц-связи. Кроме того, удобные клавиши мультимедиа обеспечат быстрый и простой доступ к функциям управления микрофоном, динамиком и камерой.\nВысокая скорость передачи данных\nСкорость обмена данными через порты USB 3.0 в 10 раз превышает скорость при использовании более ранних версий USB, что обеспечивает практически мгновенное копирование больших медиафайлов, а также эффективные соединения между периферийными аудио- и видеоустройствами."
  }
}